package lesson3;

public class LoopSquare {

    /**
     * Дописать метод main() так, чтобы в результате получался квадрат из звёздочек размером 10х10.
     * Между звездочками должны быть пробелы. System.out.println() разрешается использовать один раз.
     * Использовать цикл for для реализации задачи.
     * Пример вывода:
     * * * * * * * * * * *
     * * * * * * * * * * *
     * * * * * * * * * * *
     * * * * * * * * * * *
     * * * * * * * * * * *
     * * * * * * * * * * *
     * * * * * * * * * * *
     * * * * * * * * * * *
     * * * * * * * * * * *
     * * * * * * * * * * *
     */

    public static void main(String[] args) {

    }
}
