package lesson3;

public class Magic8ball {

    /**
     * Сделать магического шара восьмёрки. Фразы должны находиться в виде строки в ArrayList.
     * Для реализации задачи использовать классы Random и ArrayList.
     * Метод getResult() должен отдавать строковое значение со случайной фразой из массива (ArrayList) строк (фраз).
     * При запускпе программа должна выводить приглашение ввести вопрос (Scanner) и в качестве результата выводить
     * на экран случайную фразу из списка.
     * phrases.add("As I see it, yes");
     * "Ask again later"
     * "Better not tell you now"
     * "Cannot predict now"
     * "Concentrate and ask again"
     * "Don’t count on it"
     * "It is certain"
     * "It is decidedly so"
     * "Most likely"
     * "My reply is no"
     * "My sources say no"
     * "Outlook good"
     * "Outlook not so good"
     * "Reply hazy try again"
     * "Signs point to yes"
     * "Very doubtful"
     * "Without a doubt"
     * "Yes"
     * "Yes, definitely"
     * "You may rely on it"
     */

    public static void main(String[] args) {
        System.out.println(getResult());
    }

    public static String getResult() {
        //Написать реализацию метода тут
        return "";
    }

}
