package lesson4;

public class Elka {

    /**
     *          Используя вложенные for loop нарисовать фигуру
     *
     *          *
     *          * *
     *          * * *
     *          * * * *
     *          * * * * *
     *          * * * * * *
     *          * * * * * * *
     *          * * * * * * * *
     *          * * * * * * * * *
     *          * * * * * * * *
     *          * * * * * * *
     *          * * * * * *
     *          * * * * *
     *          * * * *
     *          * * *
     *          * *
     *          *
     */

    public static void main(String[] args) {
        // Писать код тут
    }
}
