package lesson4;

/**
 * ВАРИАНТ 1:
 * Написать метод, принимающий в качестве параметра два числа.
 * Метод должен находить максимальное из этих двух чисел.
 * Метод должен возвращать максимальное число как результат.
 * Вызвать метод и main с параметрами, убедиться что показывается максимальное из двух чисел.
 *
 * Дополнительное условие: нельзя использовать библиотеку Math.
 *
 * ВАРИАНТ 2:
 * Дополнительно реализовать аналогичный первому варианту метод в этом же классе, однако используя
 * библиотеку Math.
 * Вызвать метод и main с параметрами, убедиться что показывается максимальное из двух чисел.
 */

public class MaxNumber {
}
